#include <stdio.h>
int main()
{
	
	
	double I,B;
	printf("请输入利润：");
	scanf_s("%lf",&I);
	if(I<=100000)
	{
		B=I*0.1;
	}  
	else if(100000<I&&I<=200000)
	{
		B=10000+(I-100000)*0.075;
		
	}
	else if(200000<I&&I<=400000)
	{
		B=17500+(I-200000)*0.05;
		
	}
	else if(400000<I&&I<=600000)
	{
		B=27500+(I-400000)*0.03;
		
	}
	else if(600000<I&&I<=1000000)
	{
		B=33500+(I-600000)*0.015;
	}
	else if (I>=1000000)
	{
		B=39500+(I-1000000)*0.01;
	}
	
	
	
	
	printf("应发的奖金总数为：%.2lf",B);
	
	
	
	
	
	
	
	
	
	
	
	
	return 0;
}
